Documents/Заявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Заявки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПрикрепленныеФайлы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелоЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветПользователю</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрикрепленныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлу</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Заявки/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если ДиалогВыбора.Выбрать() Тогда 		
		//НовоеВложение = Объект.Вложения.Добавить();
		//НовоеВложение.ПутьКФайлу = ДиалогВыбора.ПолноеИмяФайла;
		//ДиалогВыбора.ПолноеИмяФайла
		//ИмяФайла = СформироватьИмяФайлаНаСервере(ДиалогВыбора.ПолноеИмяФайла);
		
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ИмяФайла", СтрЗаменить(ДиалогВыбора.ПолноеИмяФайла,ДиалогВыбора.Каталог,""));
		СтруктураОтбора.Вставить("ПутьКФайлу",ДиалогВыбора.ПолноеИмяФайла); 
		НайденныеПрикрепленныеФайлы = Объект.ПрикрепленныеФайлы.НайтиСтроки(СтруктураОтбора);
		Если НайденныеПрикрепленныеФайлы.Количество()>0 Тогда 
			Сообщить("Данный файл '" + ДиалогВыбора.ПолноеИмяФайла + "' уже есть в списке прикрепленных!");
		Иначе
			НовыйФайл = Объект.ПрикрепленныеФайлы.Добавить();
			НовыйФайл.ИмяФайла = СтрЗаменить(ДиалогВыбора.ПолноеИмяФайла,ДиалогВыбора.Каталог,"");
			НовыйФайл.ПутьКФайлу = ДиалогВыбора.ПолноеИмяФайла;
		КонецЕсли;
		
		//СохранитьФайлНаСервере(ДиалогВыбора.ПолноеИмяФайла);
		
		
		
		
		//ПутьСохраненияФайла = ПутьКХранилищуФайлов+"\"+ИмяФайла;
		//ХранилищеФайла = Новый ХранилищеЗначения(Вложение.Данные);
		//ДвоичныеДанные = ХранилищеФайла.Получить();
		//ДвоичныеДанные.Записать(ПутьСохраненияФайла);
		//НовыйФайл = НоваяЗаявка.Вложения.Добавить();	
		//НовыйФайл.ПутьКФайлу = ПутьСохраненияФайла;	
		//ТекстЗаявки = СтрЗаменить(ТекстЗаявки,"cid:"+Вложение.Идентификатор,ПутьСохраненияФайла);
		
		
		
	КонецЕсли;
КонецПроцедуры

Функция СформироватьИмяФайлаНаСервере(ИмяФайла)
	Возврат ОбщийФайлы.СформироватьИмяФайла(ИмяФайла);	
КонецФункции  

&НаСервере
Процедура СохранитьФайлНаСервере(ИмяФайла)
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.СохранитьФайлНаСервере(ИмяФайла,Объект.Номер);
КонецПроцедуры

&НаСервере
Процедура ОтправитьОтветНаСервере()	
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();	
		
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтвет(Команда)
	ОтправитьОтветНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	ЗапуститьПриложение(Объект.ПрикрепленныеФайлы[ЭтаФорма.Элементы.ПрикрепленныеФайлы.ТекущаяСтрока].ПутьКФайлу);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для каждого стрФайл Из Объект.ПрикрепленныеФайлы Цикл 
		
		
	КонецЦикла;
КонецПроцедуры
